{
  "title": {
    "pt-BR": "Sobre mim",
    "en-US": "About Me"
  },
  "text": {
    "pt-BR": "<p class=\"first\" style='font-weight:300;margin-bottom:20px'>Meu nome é André, tenho 39 anos, sou brasileiro, casado e pai orgulhoso de três filhos maravilhosos. A tecnologia sempre foi uma paixão para mim, impulsionando tanto meus interesses pessoais quanto minha trajetória profissional.</p><p style='font-weight:300;margin-bottom:20px'>Comecei minha jornada na tecnologia em uma pequena empresa em São Paulo, Brasil. Aos 19 anos, meu conhecimento em Linux — algo raro na época — chamou a atenção da empresa e levou à minha contratação. Lá, me aprofundei nos conhecimentos de redes, além de servidores Linux e Windows.</p><p style='font-weight:300;margin-bottom:20px'>Ao longo da minha carreira, tive a oportunidade de trabalhar em empresas grandes e respeitadas, o que contribuiu significativamente para meu domínio de diversas tecnologias. No entanto, a lição mais valiosa que aprendi foi a importância do aprendizado contínuo e da humildade. A tecnologia é um universo em constante evolução, e para se manter relevante é preciso nunca parar de estudar e se adaptar. Ter uma mentalidade de aprendizado constante não apenas nos mantém competitivos, mas também nos capacita a contribuir de forma significativa com a área. A humildade, em especial, foi essencial no meu crescimento. Reconhecer que sempre há algo novo a aprender e estar aberto a diferentes perspectivas aumentou minha capacidade de colaborar e enfrentar novos desafios. No mundo da tecnologia, equilibrar humildade e confiança não é apenas benéfico — é essencial para prosperar.</p><p style='font-weight:300;margin-bottom:20px'>Atualmente, estou vivendo uma das fases mais desafiadoras e empolgantes da minha carreira — liderando um time de SREs e SWEs. Essa função representou uma mudança significativa em relação aos meus papéis anteriores mais técnicos. Enquanto me comunicar com máquinas, navegar por terminais e escrever código era algo natural para mim, gerenciar pessoas exige um conjunto de habilidades completamente diferente e uma nova mentalidade. A transição de colaborador individual para líder envolve assumir responsabilidades como mentoria, feedback e promoção de um ambiente colaborativo. Trata-se de capacitar outros, apoiar seu crescimento e alinhar os esforços do time aos objetivos organizacionais. Essa mudança me ensinou o valor das soft skills, da inteligência emocional e do aprendizado contínuo na liderança. Ao trilhar esse caminho, permaneço comprometido com meu crescimento pessoal e com o sucesso da minha equipe. Acredito que uma liderança eficaz não se trata apenas de guiar os outros, mas também de evoluir a si mesmo.</p><p style='font-weight:300;margin-bottom:20px'>Fora da vida profissional, valorizo uma vida simples e plena ao lado da minha esposa e de nossos três filhos maravilhosos. Aproveitamos nosso tempo juntos criando memórias duradouras por meio de refeições em família, aventuras ao ar livre e momentos do dia a dia. Essas experiências não apenas fortalecem nossos laços familiares, mas também contribuem para o nosso bem-estar. Passar tempo de qualidade com quem amamos melhora a saúde mental, aprimora a comunicação e promove um sentimento de pertencimento. Para nós, a alegria encontrada nesses momentos simples é inestimável — um lembrete do que realmente importa na vida.</p>",
    "en-US": "<p class=\"first\" style='font-weight:300;margin-bottom:20px'>My name is André and I'm a 39-year-old Brazilian, happily married and a proud father of three wonderful children. Technology has always been a passion of mine, fueling both my personal interests and professional endeavors.</p><p style='font-weight:300;margin-bottom:20px'>I began my journey in technology at a small company in São Paulo, Brazil. At 19, my proficiency in Linux—a rarity at the time—caught their attention and led to my hiring. There, I immersed myself in learning everything I needed to know about networking, as well as Windows and Linux servers.</p><p style='font-weight:300;margin-bottom:20px'>Throughout my career, I've had the opportunity to work with several reputable and large companies, each contributing to my understanding of various technologies. However, the most valuable lesson I've learned is the importance of continuous learning and humility. Technology is an ever-evolving universe, and to stay relevant, one must never stop studying and adapting. Embracing a mindset of lifelong learning not only keeps you competitive but also empowers you to contribute meaningfully to your field. Humility, in particular, has been instrumental in my growth. Recognizing that there's always more to learn and being open to new perspectives has enhanced my ability to collaborate effectively and adapt to new challenges. In the tech world, balancing humility and confidence is not just beneficial; it's essential for thriving.</p><p style='font-weight:300;margin-bottom:20px'>Currently, I find myself in one of the most challenging and exciting phases of my career—leading a team of SREs and SWEs. This role has been a profound shift from my previous hands-on technical positions. While communicating with machines, navigating terminals, and writing code came naturally to me, managing people requires a different set of skills and a new mindset. Transitioning from an individual contributor to a managerial role involves embracing responsibilities such as mentoring, providing feedback, and fostering a collaborative team environment. It's about empowering others, facilitating their growth, and aligning team efforts with organizational goals. This shift has taught me the importance of soft skills, emotional intelligence, and continuous learning in leadership. As I navigate this journey, I remain committed to personal growth and to supporting my team in achieving excellence. I believe that effective leadership is not just about guiding others but also about evolving oneself.</p><p style='font-weight:300;margin-bottom:20px'>Beyond my professional endeavors, I cherish a simple and fulfilling life with my wife and our three wonderful children. We treasure our time together, creating lasting memories through shared meals, outdoor adventures, and everyday moments. These experiences not only strengthen our family bonds but also contribute to our overall well-being. Spending quality time with loved ones has been shown to improve mental health, enhance communication skills, and foster a sense of belonging. For us, the joy found in these simple moments is invaluable, reminding us of what truly matters in life.</p>"
  }
}