[
  {
    "company": "Stone",
    "periodo": "2022 - Presente",
    "position": {
      "pt-BR" : "Platform Engineering Manager",
      "en-US" : "Platform Engineering Manager"
    },
    "text": {
      "pt-BR" : "Atualmente estou na Stone, uma gigante companhia do setor financeiro brasileiro. Cheguei em 2022 para atuar em um time de engenharia, que desenhava a arquitetura de novos projetos. Depois de 6 meses, migrei para um time de automação, onde trabalhei no desenvolvimento de soluções de autosserviço no ambiente on-premises da companhia. Nesse período, trabalhei com tecnologias como: Ansible, Rundeck, Terraform, Python, entre outras. Após um curto período atuando nesse time, migrei para a área responsável pela criação do IDP (Internal Developer Platform) da companhia, onde tive a oportunidade de implementar o DevLake, um serviço da Apache para gestão de métricas de DevOps. Após um período como SRE (Site Reliability Engineer), fui convidado a liderar um time de engenheiros de software. Esse tem sido meu maior desafio até aqui, além de ser o momento de maior aprendizado. Sempre gostei de estar em contato com a tecnologia e de desenvolver soluções a nível de código, mas este momento tem me proporcionado experiências completamente distintas, onde meu trabalho como líder envolve o desenvolvimento de outras pessoas, além de proporcionar um ambiente para que elas consigam realizar suas entregas de forma eficaz.",
      "en-US" : "Currently, I am at Stone, a giant company in the Brazilian financial sector. I joined in 2022 to work in an engineering team that designed the architecture of new projects. After 6 months, I migrated to an automation team, where I worked on developing self-service solutions in the company's on-premises environment. During this period, I worked with technologies such as: Ansible, Rundeck, Terraform, Python, among others. After a short time in this team, I moved to the area responsible for creating the IDP (Internal Developer Platform) of the company, where I had the opportunity to implement DevLake, an Apache service for managing DevOps metrics. After a period as SRE (Site Reliability Engineer), I was invited to lead a team of software engineers. This has been my biggest challenge so far and also my greatest learning moment. I've always enjoyed being in touch with technology and developing solutions at the code level, but this moment has provided me with completely different experiences, where my work as a leader involves developing other people and providing an environment for them to deliver their work effectively."
    },
    "color": "#277DA1",
    "website": "https://stone.com.br/"
  },
  {
    "company": "TIVIT",
    "periodo": "2019 - 2022",
    "position": {
      "pt-BR" : "Especialista em DevOps",
      "en-US" : "DevOps Specialist"
    },
    "text": {
      "pt-BR" : "Em dezembro de 2019, fui para a TIVIT, onde tive a oportunidade de trabalhar em um time multidisciplinar que atendia mais de 50 clientes. Entrei para a equipe como especialista em Linux, mas, durante esse período, iniciei minha migração para a área de DevOps, onde pude implementar serviços de observabilidade e gestão de configuração de servidores utilizando IaC (Infrastructure as Code). Foi um momento de muito aprendizado. Naquela época, foquei meus estudos em Python, SaltStack, Prometheus e Grafana. Contribuí para a construção de serviços que ajudaram e permitiram ao time realizar a gestão e o suporte com mais qualidade aos mais de 1.500 servidores de diversas empresas na nossa carteira. Foram 2 anos e 4 meses de muito crescimento na minha carreira, além de uma oportunidade de conhecer grandes profissionais.",
      "en-US" : "In December 2019, I joined TIVIT, where I had the opportunity to work in a multidisciplinary team serving over 50 clients. I joined the team as a Linux specialist, but during this period, I started my migration to the DevOps area, where I was able to implement observability and server configuration management services using IaC (Infrastructure as Code). It was a time of great learning. At that time, I focused my studies on Python, SaltStack, Prometheus, and Grafana. I contributed to building services that helped and allowed the team to manage and support over 1,500 servers from various companies in our portfolio with more quality. It was 2 years and 4 months of significant growth in my career and an opportunity to meet great professionals."
    },
    "color": "#577590",
    "website": "https://tivit.com/"
  },
  {
    "company": "OTG",
    "periodo": "2012 - 2019",
    "position": {
      "pt-BR" : "Especialista em Infraestrutura",
      "en-US" : "Infrastructure Specialist"
    },
    "text": {
      "pt-BR" : "Em 2012, fui para a OTG, uma empresa de consultoria do interior de São Paulo. Fiquei alocado no Carrefour durante 6 anos, período no qual atuei como consultor em projetos envolvendo servidores Linux e Unix. Trabalhei em implementações de grandes projetos, além de migrações de sistemas e implementações de hardware em data centers. Após alguns anos, voltei para a Vivo (alocado pela OTG) para participar de uma grande migração de sistemas, onde trabalhei na implementação de automações para acelerar o processo de migração e também nas janelas de mudanças. Foram ao todo 7 anos que me ajudaram a crescer como profissional. Tive a oportunidade de trabalhar em diversos projetos, com escopos variados, colaborando com várias áreas, o que proporcionou um grande desenvolvimento em minha carreira.",
      "en-US" : "In 2012, I joined OTG, a consulting company in the interior of São Paulo. I was allocated to Carrefour for 6 years, during which I worked as a consultant on projects involving Linux and Unix servers. I worked on large project implementations, system migrations, and hardware implementations in data centers. After a few years, I returned to Vivo (allocated by OTG) to participate in a major system migration, where I worked on implementing automations to speed up the migration process and also during change windows. In total, it was 7 years that helped me grow as a professional. I had the opportunity to work on various projects with different scopes, collaborating with multiple areas, which greatly contributed to my career development."
    },
    "color": "#43AA8B",
    "website": "https://otg.com.br/"
  },
  {
    "company": "Vivo S/A",
    "periodo": "2009 - 2012",
    "position": {
      "pt-BR":"Analista de Suporte Linux/Unix",
      "en-US":"Linux/Unix Support Analyst"
    },
    "text": {
      "pt-BR" : "Em 2009, tive o prazer de começar a trabalhar na Vivo, uma das maiores companhias de telefonia do mundo. Cheguei empolgado, pronto para mostrar todo o conhecimento que havia acumulado nos poucos anos de experiência até então, mas recebi uma das maiores lições sobre humildade que poderia ter. Na época, com apenas 23 anos e em uma empresa do porte da Vivo, estava nas nuvens. Porém, a realidade logo se apresentou. Fui apresentado ao parque tecnológico da companhia, algo que nunca havia visto antes: servidores de grande porte, mainframes e pessoas com décadas de experiência na área de tecnologia. Foi aí que percebi que minha jornada estava apenas começando e que, para crescer nessa área, eu deveria me aproximar de pessoas muito boas. Fiquei três anos na companhia, período no qual aprendi muito sobre tecnologia, processos e governança.",
      "en-US" : "In 2009, I had the pleasure of starting to work at Vivo, one of the largest telecommunications companies in the world. I arrived excited, ready to showcase all the knowledge I had accumulated in the few years of experience until then, but I received one of the greatest lessons in humility I could have. At that time, at just 23 years old and in a company of Vivo's size, I was on cloud nine. However, reality soon presented itself. I was introduced to the company's technological park, something I had never seen before: large servers, mainframes, and people with decades of experience in the technology field. That's when I realized my journey was just beginning and that to grow in this area, I needed to get close to very skilled individuals. I spent three years at the company, during which I learned a lot about technology, processes, and governance."
    },
    "color": "#90BE6D",
    "website": "https://www.vivo.com.br/"
  },
  {
    "company": "Ludwig Institute",
    "periodo": "2008 - 2009",
    "position": {
      "pt-BR" : "Desenvolvedor de Software",
      "en-US" : "Developer"
    },
    "text": {
      "pt-BR" : "Esse trabalho foi um dos que mais me marcaram, pois representou uma conquista pessoal da qual tenho orgulho até hoje. O Instituto Ludwig é um centro de pesquisa sobre câncer com atuação global, promovendo e financiando estudos em busca da cura para diversos tipos da doença.Conquistei uma vaga para atuar como programador, participando diretamente de projetos de pesquisa. Mesmo sem experiência prévia na área, consegui me destacar graças ao meu conhecimento em programação. Estive nesse trabalho por apenas 9 meses, mas foram 9 meses de aprendizado intenso. Tive meu primeiro contato com a linguagem Perl, na qual desenvolvia scripts que, integrados à linguagem R, permitiam a geração de relatórios e gráficos utilizados por pesquisadores no desenvolvimento de medicamentos para diferentes tipos de câncer.",
      "en-US" : "This job was one of the most significant for me, as it represented a personal achievement that I am proud of to this day. The Ludwig Institute is a global cancer research center that promotes and funds studies in search of cures for various types of the disease. I secured a position as a programmer, directly participating in research projects. Even without prior experience in the field, I managed to stand out thanks to my programming knowledge. I was in this job for only 9 months, but they were 9 months of intense learning. I had my first contact with the Perl language, in which I developed scripts that, integrated with the R language, allowed the generation of reports and graphs used by researchers in the development of drugs for different types of cancer."
    },
    "color": "#F9C74F",
    "website": "https://www.ludwigcancerresearch.org/"
  },
  {
    "company": "SHX",
    "periodo": "2006 - 2008",
    "position": {
      "pt-BR" : "Analista de Suporte",
      "en-US" : "Support Analyst"
    },
    "text": {
      "pt-BR" : "Trabalhei na SHX durante um ano e meio, e nesse período, além de desenvolver ainda mais minhas habilidades técnicas com servidores Linux, redes e manutenção de hardware de computadores e servidores, tive também minha primeira experiência direta com o público. Uma de minhas atribuições era visitar os clientes para realizar implementações de sistemas. Viajei por diversas regiões do Brasil e conheci muitas pessoas — o que me fez crescer como pessoa, pois pude desenvolver meu lado humano, além de aprender técnicas de comunicação e como me portar frente ao cliente.",
      "en-US" : "I worked at SHX for a year and a half, and during this period, in addition to further developing my technical skills with Linux servers, networks, and hardware maintenance of computers and servers, I also had my first direct experience with the public. One of my responsibilities was to visit clients to implement systems. I traveled to various regions of Brazil and met many people, which helped me grow as a person, as I was able to develop my human side, as well as learn communication techniques and how to behave in front of the client."
    },
    "color": "#F3722C",
    "website": "https://www.shx.com.br/"
  },
  {
    "company": "Gempi",
    "periodo": "2005 - 2006",
    "position": {
      "pt-BR" : "Estagiário",
      "en-US" : "Intern"
    },
    "text": {
      "pt-BR" : "Esse foi meu primeiro trabalho na área de tecnologia. Prestava suporte a pequenos servidores Linux e Windows, auxiliava os desenvolvedores na instalação de novos servidores para implementação de banco de dados, além de implementar novas estruturas de redes de computadores. Nesse trabalho de estagiário, me sobrava muito tempo — foi então que aproveitei esse tempo vago para aprender programação e linguagens como PHP e JavaScript. Trabalhei nessa empresa apenas por um ano, porém foi um ano de muito aprendizado e muitas lições, as quais levo comigo até hoje.",
      "en-US" : "This was my first job in the technology field. I provided support for small Linux and Windows servers, assisted developers in installing new servers for database implementation, and implemented new computer network structures. In this intern role, I had a lot of free time, which I took advantage of to learn programming and languages like PHP and JavaScript. I worked at this company for only a year, but it was a year filled with learning and many lessons that I carry with me to this day."
    },
    "color": "#F94144",
    "website": "https://www.gempi.com.br/"
  }
]