{
  "title": {
    "pt-BR": "Habilidades",
    "en-US": "Skills"
  },
  "skills": [
    {
      "skill": {
        "pt-BR": "Linux",
        "en-US": "Linux"
      },
      "text": {
        "pt-BR": "<p style='font-weight:300'>Ao longo da minha carreira, foquei em me tornar um especialista em sistemas operacionais Linux. Quando comecei, a área de tecnologia era muito segmentada, com equipes de redes, desenvolvimento e operações de infraestrutura raramente se comunicando no dia a dia. Eventualmente, em alguma agenda de mudança, os times precisavam se alinhar para validar os ambientes.</p><p style='font-weight:300'>Nessa época, me destaquei como um bom administrador Linux, desempenhando o papel de implementar servidores e instalar as aplicações que iriam rodar neles. Além disso, desenvolvi habilidades sólidas em troubleshooting e análise de logs, permitindo identificar rapidamente causas raiz de problemas nos ambientes. Utilizando ferramentas de linha de comando, conseguia diagnosticar e resolver falhas de forma eficiente, garantindo a estabilidade e o desempenho dos sistemas.</p><p style='font-weight:300'>Além disso, adquiri experiência em configurar serviços de compartilhamento de arquivos e implementar sistemas de arquivos (file systems) que exigiam configurações adicionais para alcançar o desempenho desejado pelas aplicações. Para isso, aprofundei meus conhecimentos em LVM (Logical Volume Manager) e explorei as possibilidades de combinar tipos de discos e configurações de RAID para otimizar métricas de desempenho. Essa base sólida em Linux e automação foi fundamental para minha evolução profissional, permitindo-me adaptar-me às mudanças tecnológicas e assumir desafios mais complexos ao longo da minha carreira.</p>",
        "en-US": "<p style='font-weight:300'>Throughout my career, I have focused on becoming a specialist in Linux operating systems. When I started out, the tech field was highly segmented, with networking, development, and infrastructure operations teams rarely communicating in their daily routines. Occasionally, during change initiatives, these teams had to align to validate environments.</p><p style='font-weight:300'>At that time, I stood out as a skilled Linux administrator, responsible for deploying servers and installing the applications that would run on them. I also developed strong troubleshooting and log analysis skills, which enabled me to quickly identify root causes of issues in various environments. Using command-line tools, I could efficiently diagnose and resolve failures, ensuring system stability and performance.</p><p style='font-weight:300'>Additionally, I gained experience configuring file-sharing services and implementing file systems that required advanced tuning to meet application performance needs. To support this, I deepened my knowledge of LVM (Logical Volume Manager) and explored combinations of disk types and RAID configurations to optimize performance metrics. This strong foundation in Linux and automation has been essential to my professional growth, allowing me to adapt to technological changes and take on increasingly complex challenges throughout my career.</p>"
      },
      "tags": {
        "pt-BR": [
          "Linux",
          "Shell",
          "Bash",
          "Scripting",
          "Solução de Problemas",
          "Sistemas de Arquivos",
          "LVM",
          "RAID"
        ],
        "en-US": [
          "Linux",
          "Shell",
          "Bash",
          "Scripting",
          "Troubleshooting",
          "File Systems",
          "LVM",
          "RAID"
        ]
      }
    },
    {
      "skill": {
        "pt-BR": "DevOps",
        "en-US": "DevOps"
      },
      "text": {
        "pt-BR": "<p style='font-weight:300'>Com o tempo, percebi que a área de infraestrutura estava mudando rapidamente. As equipes de desenvolvimento começaram a se aproximar das operações, e o conceito de DevOps começou a ganhar força. Essa mudança me motivou a buscar novas oportunidades e expandir meu conhecimento em automação e integração contínua.</p><p style='font-weight:300'>Participei de projetos que envolviam a implementação de ferramentas de automação, como Ansible e Terraform, para gerenciar configurações e provisionar infraestrutura de forma eficiente. Aprendi a criar pipelines de CI/CD (Integração Contínua/Entrega Contínua) para automatizar o processo de construção, teste e implantação de aplicações. Essa experiência me permitiu entender melhor o ciclo de vida do desenvolvimento de software e como as operações podem se integrar nesse processo.</p><p style='font-weight:300'>Além disso, trabalhei com containers e orquestração, utilizando Docker e Kubernetes para criar ambientes escaláveis e portáteis. Essa abordagem me ajudou a otimizar o uso de recursos e melhorar a eficiência operacional.</p>",
        "en-US": "<p style='font-weight:300'>Over time, I realized that the infrastructure field was evolving rapidly. Development teams began working more closely with operations, and the concept of DevOps started to gain momentum. This shift motivated me to seek new opportunities and expand my knowledge in automation and continuous integration.</p><p style='font-weight:300'>I took part in projects involving the implementation of automation tools such as Ansible and Terraform to manage configurations and provision infrastructure efficiently. I learned how to create CI/CD (Continuous Integration/Continuous Delivery) pipelines to automate the build, testing, and deployment processes for applications. This experience gave me a deeper understanding of the software development lifecycle and how operations can integrate into that process.</p><p style='font-weight:300'>Additionally, I worked with containers and orchestration, using Docker and Kubernetes to build scalable and portable environments. This approach helped me optimize resource usage and improve operational efficiency.</p>"


      },
      "tags": {
        "pt-BR": [
          "DevOps",
          "Integração/Entrega Contínua (CI/CD)",
          "Ansible",
          "SaltStack",
          "Terraform",
          "Docker",
          "Infraestrutura como Código (IaC)",
          "Kubernetes",
          "Prometheus"
        ],
        "en-US": [
          "DevOps",
          "Continuous Integration/Delivery (CI/CD)",
          "Ansible",
          "SaltStack",
          "Terraform",
          "Docker",
          "Infrastructure as Code (IaC)",
          "Kubernetes",
          "Prometheus"
        ]
      }
    },
    {
      "skill": {
        "pt-BR": "Desenvolvimento de Software",
        "en-US": "Software Development"
      },
      "text": {
        "pt-BR": "<p style='font-weight:300'>Desde o início da minha carreira, sempre tive um forte interesse por programação. Durante a faculdade, obtive excelentes notas nas disciplinas relacionadas e não encontrei dificuldades significativas. No entanto, minha trajetória profissional me direcionou predominantemente para a área de infraestrutura. Mesmo assim, consegui aplicar meus conhecimentos em programação para automatizar tarefas, aumentando a eficiência dos processos e reduzindo erros humanos e retrabalhos desnecessários.</p><p style='font-weight:300'>Por muitos anos, utilizei PHP em diversos projetos, o que me proporcionou uma base sólida em desenvolvimento web. Em 2019, mergulhei no universo da linguagem Python, o que despertou ainda mais meu interesse pelas boas práticas de desenvolvimento de software. Python me ajudou a compreender conceitos fundamentais como orientação a objetos, polimorfismo e princípios de design de software.</p><p style='font-weight:300'>Atualmente, tenho direcionado meus estudos para a linguagem Go (Golang). Nos últimos dois anos, venho utilizando Go em minhas implementações, e tem sido uma experiência fantástica. Go se destaca por sua simplicidade, desempenho e modelo de concorrência eficiente, baseado em goroutines e channels, permitindo a construção de aplicações altamente escaláveis e responsivas.</p><p style='font-weight:300'>Como líder de uma equipe de engenheiros de software e SREs, dedico parte do meu tempo ao aprofundamento em conceitos de design de software. Isso me permite acompanhar de perto as atividades do time e contribuir de forma assertiva para as entregas, garantindo que as soluções desenvolvidas sejam robustas, eficientes e alinhadas com as melhores práticas do mercado.</p>",
        "en-US": "<p style='font-weight:300'>Since the beginning of my career, I’ve always had a strong interest in programming. During college, I earned excellent grades in programming-related courses and never faced significant difficulties. However, my professional path primarily led me into the infrastructure field. Even so, I was able to apply my programming knowledge to automate tasks, increasing efficiency and reducing human errors and unnecessary rework.</p><p style='font-weight:300'>For many years, I used PHP in various projects, which gave me a solid foundation in web development. In 2019, I immersed myself in the world of Python, which further deepened my interest in software development best practices. Python helped me understand fundamental concepts such as object-oriented programming, polymorphism, and software design principles.</p><p style='font-weight:300'>Currently, I’ve been focusing my studies on the Go programming language (Golang). Over the past two years, I’ve used Go in my implementations, and it has been a fantastic experience. Go stands out for its simplicity, performance, and efficient concurrency model based on goroutines and channels, enabling the development of highly scalable and responsive applications.</p><p style='font-weight:300'>As the leader of a team of software engineers and SREs, I dedicate part of my time to deepening my understanding of software design concepts. This allows me to stay closely involved with the team's activities and contribute effectively to deliverables, ensuring that the solutions we build are robust, efficient, and aligned with industry best practices.</p>"

      },
      "tags": {
        "pt-BR": [
          "Desenvolvimento de Software",
          "Python",
          "Go",
          "PHP",
          "JavaScript",
          "Git",
          "Perl"
        ],
        "en-US": [
          "Software Development",
          "Python",
          "Go",
          "PHP",
          "JavaScript",
          "Git",
          "Perl"
        ]
      }
    },
    {
      "skill": {
        "pt-BR": "Liderança e Gestão de Equipes",
        "en-US": "Leadership and Team Management"
      },
      "text": {
        "pt-BR": "<p style='font-weight:300'>Nos últimos dois anos, embarquei em uma jornada de autodescoberta ao assumir uma posição de liderança. Descobri que posso influenciar positivamente a vida de outras pessoas, não apenas através de orientações técnicas, mas também por meio de apoio emocional e desenvolvimento pessoal.</p><p style='font-weight:300'>Percebi que mesmo profissionais altamente capacitados necessitam de feedbacks sinceros e claros para alinhar suas carreiras com os objetivos da empresa. Aprendi que ouvir atentamente é, muitas vezes, a ação mais poderosa diante de desafios, permitindo-me compreender as dificuldades técnicas e pessoais de cada membro da equipe.</p><p style='font-weight:300'>Respeitar o momento e as características individuais de cada colaborador tornou-se essencial. Meu objetivo como líder é guiar cada pessoa por um caminho iluminado, onde possam realizar seu trabalho com excelência e, simultaneamente, crescer profissionalmente e como seres humanos.</p><p style='font-weight:300'>Essa abordagem está alinhada com as melhores práticas de liderança, que enfatizam a importância de uma comunicação aberta, empatia e desenvolvimento contínuo, promovendo um ambiente de trabalho colaborativo e eficiente.</p>",
        "en-US": "<p style='font-weight:300'>Over the past two years, I’ve embarked on a journey of self-discovery through taking on a leadership role. I’ve learned that I can positively influence the lives of others—not only through technical guidance but also by offering emotional support and encouraging personal growth.</p><p style='font-weight:300'>I realized that even highly skilled professionals need honest and clear feedback to align their careers with the company’s goals. I’ve come to understand that actively listening is often the most powerful action when facing challenges, as it allows me to grasp both the technical and personal struggles of each team member.</p><p style='font-weight:300'>Recognizing and respecting the individual timing and characteristics of each person has become essential. My goal as a leader is to guide each individual along a meaningful path—one where they can perform with excellence while growing both professionally and personally.</p><p style='font-weight:300'>This approach aligns with leadership best practices, which emphasize the importance of open communication, empathy, and continuous development, fostering a collaborative and effective work environment.</p>"
      },
      "tags": {
        "pt-BR": [
          "Liderança",
          "Gestão de Equipes",
          "Mentoria",
          "Feedbacks",
          "Comunicação",
          "Empatia",
          "Desenvolvimento Pessoal"
        ],
        "en-US": [
          "Leadership",
          "Team Management",
          "Mentoring",
          "Feedback",
          "Communication",
          "Empathy",
          "Personal Development"
        ]
      }
    }
  ]
}